Tekla.Structures.Model.BoltGroup
The BoltGroup class is an abstract base class for all bolt shapes, such as array, circle and XY list.
See the Tekla Structures help file for further information about the attributes.

Tekla.Structures.Model.BoltGroup.BoltSize
The size of the bolts in the group.

Tekla.Structures.Model.BoltGroup.BoltStandard
The standard of the bolt group.

Tekla.Structures.Model.BoltGroup.BoltType
The type of the bolt group.

Tekla.Structures.Model.BoltGroup.ThreadInMaterial
Whether the thread goes inside the materal or not.

Tekla.Structures.Model.BoltGroup.Length
The length. An extra variable that is only set when the bolt group is made of studs instead of bolts.

Tekla.Structures.Model.BoltGroup.CutLength
The cut length.

Tekla.Structures.Model.BoltGroup.ExtraLength
The extra length for the bolts.

Tekla.Structures.Model.BoltGroup.Shape
The shape of the bolt group.

Tekla.Structures.Model.BoltGroup.Tolerance
The hole tolerance.

Tekla.Structures.Model.BoltGroup.HoleType
The special hole type: oversized, slotted, blind or no hole.

Tekla.Structures.Model.BoltGroup.SlottedHoleX
Gets or sets the X allowance of the slotted hole.

Tekla.Structures.Model.BoltGroup.SlottedHoleY
Gets or sets the Y allowance of the slotted hole.

Tekla.Structures.Model.BoltGroup.SlotOffsetX
Gets or sets the slotted hole offset X.

Tekla.Structures.Model.BoltGroup.SlotOffsetY
Gets or sets the slotted hole offset Y.

Tekla.Structures.Model.BoltGroup.BlindHoleDepth
Gets or sets the blind hole depth.

Tekla.Structures.Model.BoltGroup.PlainHoleType
Gets or sets the plain hole type.

Tekla.Structures.Model.BoltGroup.RotateSlots
Gets or sets the rotation of the slots: odd, even or parallel.

Tekla.Structures.Model.BoltGroup.Position
The position attributes.

Tekla.Structures.Model.BoltGroup.StartPointOffset
The start point offset values of the bolt group.

Tekla.Structures.Model.BoltGroup.EndPointOffset
The end point offset values of the bolt group.

Tekla.Structures.Model.BoltGroup.Washer1
Indicates whether the washer 1 is used in the assembly.

Tekla.Structures.Model.BoltGroup.Washer2
Indicates whether the washer 2 is used in the assembly.

Tekla.Structures.Model.BoltGroup.Washer3
Indicates whether the washer 3 is used in the assembly.

Tekla.Structures.Model.BoltGroup.Nut1
Indicates whether the nut 1 is used in the assembly.

Tekla.Structures.Model.BoltGroup.Nut2
Indicates whether the nut 2 is used in the assembly.

Tekla.Structures.Model.BoltGroup.Bolt
Indicates whether the instance is a bolt or just a hole.

Tekla.Structures.Model.BoltGroup.Hole1
Indicates whether the hole 1 is used.

Tekla.Structures.Model.BoltGroup.Hole2
Indicates whether the hole 2 is used.

Tekla.Structures.Model.BoltGroup.Hole3
Indicates whether the hole 3 is used.

Tekla.Structures.Model.BoltGroup.Hole4
Indicates whether the hole 4 is used.

Tekla.Structures.Model.BoltGroup.Hole5
Indicates whether the hole 5 is used.

Tekla.Structures.Model.BoltGroup.PartToBoltTo
The part to bolt to.

Tekla.Structures.Model.BoltGroup.PartToBeBolted
The part to be bolted.

Tekla.Structures.Model.BoltGroup.OtherPartsToBolt
The other parts to be bolted (read-only).

Tekla.Structures.Model.BoltGroup.BoltHolesAttributes
The bolt holes attributes.

Tekla.Structures.Model.BoltGroup.FirstPosition
The first position point.

Tekla.Structures.Model.BoltGroup.SecondPosition
The second position point.

Tekla.Structures.Model.BoltGroup.ConnectAssemblies
Defines whether to connect a part or an assembly as a secondary part (false) or as a sub-assembly (true).

Tekla.Structures.Model.BoltGroup._BoltPositions
Real bolt positions in selection plane

Tekla.Structures.Model.BoltGroup.BoltPositions
Gets the single bolt positions.
All the bolt positions are in the XY-plane defined by the bolt group coordinate
system. The given positions are in relation to the transformation plane
in which the bolt group was selected.

Tekla.Structures.Model.BoltGroup.#ctor
Creates a new bolt group instance with the given shape.

Tekla.Structures.Model.BoltGroup.AddOtherPartToBolt(Tekla.Structures.Model.Part)
Adds the given part to the list of the other parts that should be bolted.
M: The part to add.
Returns: True on success.

Tekla.Structures.Model.BoltGroup.RemoveOtherPartToBolt(Tekla.Structures.Model.Part)
Removes the given part from the list of the other bolted parts.
M: The part to remove.
Returns: True on success.

Tekla.Structures.Model.BoltGroup.GetOtherPartsToBolt
Returns an array list containing all the other parts that are bolted.
Returns: An array list of parts containing all the other parts that are bolted.

Tekla.Structures.Model.BoltGroup.GetSolid
Method for getting the solid information of the bolt group.
Returns: The solid instance of the bolt group.

Tekla.Structures.Model.BoltGroup.GetSolid(System.Boolean)
Method for getting the solid information of the bolt group.
withHighAccuracy: Boolean value which defines if the solid is created with high accuracy
Returns: The solid instance of the bolt group.

Tekla.Structures.Model.BoltGroup.GetFatherPour
Returns the pour that the bolt group is associated to.
Returns: The pour object.
Deprecated since TS v2018.

Tekla.Structures.Model.BoltGroup.GetFatherPourUnit
Returns the pour unit that the bolt group is associated to.
Returns: A pour unit.

Tekla.Structures.Model.BoltGroup.InsertSplitBolt
Inserts the split bolt group instance into the model database.
The inserted instance must be of real type.
Returns: True on success.

Tekla.Structures.Model.BoltGroup.BoltGroupParametersCheck
Examines bolt group parameters are well defined.

Tekla.Structures.Model.BoltGroup.FromStruct(Tekla.Structures.ModelInternal.dotBoltGroup_t@)
Converts Tekla.Structures.ModelInternal.dotBoltGroup_t structure into Tekla.Structures.Model.BoltGroup instance.
BoltGroup: The Tekla.Structures.ModelInternal.dotBoltGroup_t structure to convert from.

Tekla.Structures.Model.BoltGroup.FromStruct(Tekla.Structures.ModelInternal.dotBoltGroup_t@,System.Collections.ArrayList@)
Converts Tekla.Structures.ModelInternal.dotBoltGroup_t structure and bolt positions
into Tekla.Structures.Model.BoltGroup instance.
BoltGroup: The Tekla.Structures.ModelInternal.dotBoltGroup_t structure to convert from.
BoltPositions: The bolt positions.

Tekla.Structures.Model.BoltGroup.ChangeRotation(Tekla.Structures.Model.BoltGroup.BoltRotateSlotsEnum,System.Double,System.Double)
Changes the bolt geometry based on the rotate slots type parameter.
boltRotateSlots: The bolt rotate slots parameter.
slottedHoleXValue: The slotted hole X value used in even rotation case.
slottedHoleYValue: The slotted hole Y value used in even rotation case.

Tekla.Structures.Model.BoltGroup.AreDoublesEqual(System.Double,System.Double,System.Double)
Verifies if the first double parameter is equal to second double parameter considering an epsilon.
firstDouble: The first double to be used in the comparison.
secondDouble: The second double to be used in the comparison.
Epsilon: The approximation used by equality.
Returns: True, if the values are equal, false otherwise.

Tekla.Structures.Model.BoltGroup.HaveAllHolesTheSameLongXValue
Checks if all the individual holes have the same long x value.
Returns: True if the same, false otherwise.

Tekla.Structures.Model.BoltGroup.IsRotatedSlottedHole
Checks if the individual holes are in the odd or even rotate slots case.
Returns: True if rotated, false otherwise.

Tekla.Structures.Model.BoltGroup.HaveAllHolesTheSameLongYValue
Checks if all the individual holes have the same long y value.
Returns: True if the same, false otherwise.

Tekla.Structures.Model.BoltGroup.HaveAllHolesTypeSetToSlottedHole
Checks if all the individual holes have the type set to slotted hole.
Returns: True if all holes have the type set to slotted hole, false otherwise.

Tekla.Structures.Model.BoltGroup.AreAllSlotHoleOffsetsSetToZero
Checks if all the slot hole offsets are set to zero.
Returns: True if all the slot hole offsets are set to zero, false otherwise.